jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
/**
  *             Copyright (C) SOJO Electric CO., Ltd. 2017-2018. All right reserved.
  * @file:      commmon_data.h
  * @brief:     The commmon data of the project.
  * @version:   ver 1.1
  * @author:    Mr.Sun
  * @date:      2017-09-05
  * @update:    [2017-12-07][Lexun][make the code cleanup]
  */
	
#ifndef __COMMON_DATA_H__
#define __COMMON_DATA_H__


/* INCLUDE FILES -------------------------------------------------------------*/	
#include "rtthread.h"
#include "stm32f4xx_hal.h"
#include "single_list.h"
#include "common_config.h"
#include "point_table_config.h"

/* COMMON --------------------------------------------------------------------*/
#ifndef  FALSE
#define  FALSE     0
#define  TRUE      !FALSE
#endif /* END FALSE */

#ifndef  FULL
#define  FULL     1
#define  UNFULL      !FULL
#endif

#define ON                            0x02
#define OFF                           0x01

#define DI_CS_NUM                     2
#define THREAD_NUM                    9

#define THREAD_RUN_SLAVE101           0x0001
#define THREAD_RUN_SLAVE104           0x0002
#define THREAD_RUN_HMI                0x0004
#define THREAD_RUN_WATCH              0x0008
#define THREAD_RUN_IDLE               0x0010
#define THREAD_RUN_DP83848            0x0020
#define THREAD_RUN_W5500              0x0040
#define THREAD_RUN_CAL                0x0080
#define THREAD_RUN_PROTECT            0x0100

#define SYS_HAVE_UPDATE               0x01   
#define SYS_UPDATE_FAILED             0x02   
#define SYS_UPDATE_SUCCESS            0x00  

#define SWITCH_ALARM  (2.0f)
#define SWITCH_ON  (1.0f)
#define SWITCH_OFF (0.0f)

#define SPRING                        0 // 弹簧机构
#define MAGNET                        1 // 永磁机构  

/* 模式枚举 */
typedef enum
{
    TYPE_BREAKER_NONE,     // 无
    TYPE_BREAKER_COMMON,   // 常规保护
    TYPE_BREAKER_VOLTIME,  // 电压时间型
    TYPE_BREAKER_VOLCUR,   // 电压电流型
    TYPE_BREAKER_CURCOUNT, // 电流计数型开关
    TYPE_BREAKER_NUM
} TYPE_BREAKER;

typedef enum
{
    TYPE_LOADSWTICH_NONE = TYPE_BREAKER_NUM,     // 无
    TYPE_LOADSWTICH_VOLTIME,  // 电压时间型
    TYPE_LOADSWTICH_VOLCUR,   // 电压电流型
    TYPE_LOADSWTICH_CURCOUNT, // 电流计数型开关
	TYPE_LOADSWTICH_DIVIDE,   // 分界负荷开关
    TYPE_LOADSWTICH_NUM
} TYPE_LOADSWTICH;

#define TYPE_BREAKER                  OFF          // 断路器
#define TYPE_LOADSWTICH               ON          // 负荷开关

#define RATIO_10k_220                      (10.0f / 0.22f)
#define RATIO_100_1                        (100.0f / 1.0f)

#define RATIO_200_5                        (200 / 5)
#define RATIO_400_5                        (400 / 5)
#define RATIO_600_5                        (600 / 5)

#define RATIO_20_1                         (20 / 1)
#define RATIO_600_1                        (600 / 1)


#define MAKEWORD(low, high)           ((uint16_t)((rt_uint8_t)(low) | (((uint16_t)((rt_uint8_t)(high))) << 8)))
#define LOBYTE(w)                     ((rt_uint8_t)(w))
#define HIBYTE(w)                     ((rt_uint8_t)((uint16_t)(w) >> 8))
#define LOWORD(l)                     ((uint16_t)(l))
#define HIWORD(l)                     ((uint16_t)((uint32_t)(l) >> 16))

#define DLT_101SLAVE_MS  10
#define DLT_104SLAVE_MS  10
#define WDG_MS           1800

/* 设备枚举 */
typedef enum
{
    FRAM_ID,
    FLASH_ID,
    SLAVE101_ID0,
    SLAVE101_ID1,
    SLAVE104_ID0,
    SLAVE104_ID1,
    DEV_MAX_NUM
} DEV_ID;


/* common数据操作类型 */
enum CommonOperateInfo
{
    DB_TELESIGNAL = 0,    // 遥信
    DB_TELEMETRY,         // 遥测
    DB_READVALUE,         // 读定值/参数
    DB_VALUE_PRESET,      // 预置
    DB_VALUE_SOLID,       // 固化
    DB_VALUE_REVOKE,	    // 撤销
    DB_SOE,               // SOE
    DB_NVA,               // 遥测
    DB_SN,                // 定值区
};

/* 变比 */
enum RatioSeclect
{
    RATIO_U,
	RATIO_U0,
	RATIO_I,
	RATIO_I0,
};

/* 系统时间结构体 */
__packed struct SD2405Time
{
    rt_uint16_t msecond;    // 毫秒
    rt_uint8_t second;     // 秒
    rt_uint8_t minute;     // 分
    rt_uint8_t hour;       // 时
    rt_uint8_t week;       // 周
    rt_uint8_t day;        // 日
    rt_uint8_t month;      // 月
    rt_uint8_t year;       // 年
};


/* CP56Time2a_t时标 */
__packed struct CP56Time2a_t
{
    rt_uint8_t msecondL;
    rt_uint8_t msecondH;
    rt_uint8_t minute;
    rt_uint8_t hour;
    rt_uint8_t dayofWeek;	// WEEK(D7-D5)day(D4-D0)
    rt_uint8_t month;
    rt_uint8_t year;
};

/* NUM ----------------------------------------------------------------------*/
#define TELESIGNAL_HMI_NUM            25     	  // 面板遥信总数
#define AVERAGE_TIMER                 50          // 系数校准取模拟量次数

#define COS_MAX_NUM                   64
#define SOE_MAX_NUM                   256
#define SOE_NEW_MAX_NUM               64
#define CO_MAX_NUM                    64
#define FEVENT_MAX_NUM                16
#define NVA_MAX_NUM                   64
#define ULOG_MAX_NUM                  32  

#define INHERENT_PARAMETER_NUM      (sizeof(InherentPara) / sizeof(char) / 24)          // 终端固有参数数量
//#define RUN_PARAMETER_NUM     		(sizeof(RunParameter) / sizeof(float))         // 终端运行参数数量
///#define CALIBRATE_FACTOR_NUM        (sizeof(CalibrateFactor) / sizeof(float))      // 校准系数数量
//#define PUBLIC_VALUE_NUM            (sizeof(PublicValue) / sizeof(float))          // 公共定值数量
//#define BREAKER_VALUE_NUM           (sizeof(BreakerValue) / sizeof(float))         // 断路器定值数量
//#define LOAD_SWITCH_VALUE_NUM       (sizeof(LoadSwitchValue) / sizeof(float))      // 负荷开关定值数量
#define VALUE_PARAMETER_TOTAL_NUM   (RUN_PARAMETER_NUM+FIXED_VALUE_NUM)
//#define DB_SN0_SIZE                 (sizeof(g_Parameter))
//#define DB_SN1_SIZE                 (sizeof(PublicValue) + sizeof(BreakerValue) + sizeof(LoadSwitchValue))
//#define DB_SN2_SIZE                 (sizeof(PublicValue) + sizeof(BreakerValue) + sizeof(LoadSwitchValue))
    
/* SAMPLE ----------------------------------------------------------------------*/
#define ADC_SAMPLE_NUM                       48     // 采样半波点数
#define ADC_WAVE_SEMP_NUM                    25     // 采样全波总个数

typedef struct
{
    rt_int16_t ua[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];
	rt_int16_t ub[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];
	rt_int16_t uc[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];
	rt_int16_t u0[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];
    rt_int16_t ia[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];
	rt_int16_t ib[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];
	rt_int16_t ic[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];
	rt_int16_t i0[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];

    rt_int16_t uA[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];
    rt_int16_t uC[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];	
    
    rt_int16_t udc1[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];
    rt_int16_t udc2[ADC_WAVE_SEMP_NUM * 2][ADC_SAMPLE_NUM];	
	//rt_int8_t digtal[25][48];
}Queue;

