jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
/* DATABASE----------------------------------------------------------------------*/
/* database数据操作类型 */
typedef struct TagTelesignalAddr
{
    rt_uint16_t 
	switchOpen,	
	switchClose,
    operatingMechanism,                             // 电容欠压(储能开入)
    lowPressure,                                    // 低气压
    spareDi1,                                       // 备用1
    spareDi2,                                       // 备用2
    spareDi3,                                       // 备用3
    spareDi4,                                       // 备用4
    spareDi5,                                       // 备用5
    spareDi6,                                       // 备用6
    spareDi7,                                       // 备用7
    spareDi8,                                       // 备用8
    spareDi9,                                       // 备用9
    spareDi10,                                      // 备用10
    spareDi11,                                      // 备用11
    spareDi12,                                      // 备用12		
    breakContact,                                   // 分断/联络
    recloseFAHardStrap,                             // 重合硬/FA压板
    functionHardStrap,                              // 功能投退硬压板
    remote,                                         // 远方
    earth,                                          // 就地
    shortCircuitFault,                              // 短路故障/过流保护
    earthingFault,                                  // 接地故障/零序保护
    protectionAct,                                  // 保护动作
    protectionLock,                                 // 保护闭锁
    closingLocked,                                  // 合闸闭锁
    openingLocked,                                  // 分闸闭锁    
    recloseAct,                                     // 重合动作
    recloseLock,                                    // 重合闸闭锁
    deviceFault,                                    // 装置故障
    selfCheckAbnomal,                               // 自检异常
    communication,                                  // 通讯 
    swtichclass,                                    // 开关类型
    batteryFaultAlarm,                              // 电池故障告警
    doubleSwitch,                                   // 双点开关分合
    controlLoopDisconnection,                       // 控制回路断线
    overcurrentIa1,                                 // A相过流一段保护
    overcurrentIb1,                                 // B相过流一段保护
    overcurrentIc1,                                 // C相过流一段保护
    overcurrentIa2,                                 // A相过流二段保护
    overcurrentIb2,                                 // A相过流二段保护
    overcurrentIc2,	                                // A相过流二段保护
    overcurrentIa3,                                 // A相过流三段保护
    overcurrentIb3,                                 // A相过流三段保护
    overcurrentIc3,	                                // A相过流三段保护
    overcurrentI01,                                 // 零序过流一段保护
    overcurrentI02,	                                // 零序过流二段保护
    overcurrentAccIa,                               // A相后加速过流
    overcurrentAccIb,                               // B相后加速过流
    overcurrentAccIc,                               // C相后加速过流
    overcurrentInverseIa,                           // A相反时限过流
    overcurrentInverseIb,                           // B相反时限过流
    overcurrentInverseIc,                           // C相反时限过流
    recloseProtection1,                             // 重合闸一次保护
    recloseProtection2,                             // 重合闸二次保护
    recloseProtection3,                             // 重合闸三次保护
    recloseProtection4,                             // 重合闸四次保护
    recloseClockProtection,                         // 重合闸闭锁保护
    zeroRecloseProtection1,                         // 零序重合闸一次保护
    zeroRecloseProtection2,                         // 零序重合闸二次保护
    clockSecondaryClose,                            // 闭锁二次重合闸
    lossTrip,                                       // 失电跳闸
    getClossing,                                    // 得电合闸
    closingFaultEvent,                              // 合闸于故障
    protectionLocked,                               // 保护闭锁
    doubleProhibitClossing,                         // 双侧有压禁止合闸
    singleLossClosingEvent,                         // 单侧失压延时合闸
    remainClockClossing,                            // 残压闭锁合闸
    earthingFaultTripU0,                            // 零序电压接地故障跳闸
    smallSignalEarthingTrip,                        // 小信号接地选线跳闸
    breakingCurrent,                                // 遮断电流
    overloadEvent,                                  // 过负荷事件
    haveyOverload,                                  // 重过载	
    overVoltageProtection,                          // 过压保护
	overFrequencyProtection,                        // 过频
    downVoltageProtection,                          // 低压保护
	downFrequencyProtection,                        // 低频		
    overLimitUabUp,                                 // Uab越限
    overLimitUabDown,                               // Uab越限
    overLimitUbcUp,                                 // Ubc越限
    overLimitUbcDown,                               // Ubc越限
    overLimitUcaUp,                                 // Uca越限
    overLimitUcaDown,                               // Uca越限	
    overLimitUABUp,                                 // UAB越限
    overLimitUABDown,                               // UAB越限	
    overLimitUBCUp,                                 // UBC越限
    overLimitUBCDown,                               // UBC越限
    overLimitU0Up,                                  // 零序电压越限
    overLimitU0Down,                                // 零序电压越限
    overLimitIaUp,                                  // A相电流越限
    overLimitIaDown,                                // A相电流越限
    overLimitIbUp,                                  // B相电流越限
    overLimitIbDown,                                // B相电流越限
    overLimitIcUp,                                  // C相电流越限
    overLimitIcDown,                                // C相电流越限
    overLimitI0Up,                                  // 零序电流越限
    overLimitI0Down,                                // 零序电流越限
    overLimitDC_U_Up,                               // 直流电压越限
    overLimitDC_U_Down,                             // 直流电压越限
    overLimitDC_I_Up,                               // 直流电流越限
    overLimitDC_I_Down,                             // 直流电流越限
    devicePowerDown,                                // 装置掉电
    telecontrolrecloseOut,                          // 遥控重合闸退出  
    telecontrolContactOut,                          // 遥控联络退出
	p2p_communication_switch,                       // 对等通讯投退
	fault_removal,                                  // 对等通讯故障切除
	fault_isolated,                                 // 对等通讯故障隔离
    p2p_change_power,                               // 对等通讯转供电
	switch_refused,                                 // 开关拒动
	p2p_communication_abnormal,                     // 对等通讯异常
	p2p_work_situation,                             // 对等通讯工作情况
    overcurrentIa,                                  // A相过流保护
    overcurrentIb,                                  // B相过流保护
    overcurrentIc,                                  // C相过流保护
    overcurrentI0;                                  // 零序过流保护
}TelesignalAddr;

#define TELESIGNAL_TOTAL_NUM (sizeof(TelesignalAddr)/sizeof(rt_uint16_t))

typedef struct TagTelemetryAddr
{
    rt_uint16_t 
	F,
    Ia,
    Ib,
    Ic,
    I0,
    Uab,
    Ucb,
    Uac,
    U0,
    UAB,
    UCB,
	P,
    Q,
    S,
    PF,
    DC1,
    DC2,
    T,
	alphy_Uab_Ia,
	alphy_Ucb_Ic,
    alphy_U0_I0,
    alphy_Ux_Ux,	
    F2,	
	IaOnce,
	IbOnce,
	IcOnce,
	I0Once,	
    UabOnce,
    UbcOnce,
    UcaOnce,
    U0Once,
    UABOnce,
    UBCOnce,
	POnce,
    QOnce,
    SOnce,
	thirdharmonicUab,
	thirdharmonicUbc,
	thirdharmonicUca,
	thirdharmonicU0,
	thirdharmonicIa,
	thirdharmonicIb,
	thirdharmonicIc,
	thirdharmonicI0,
	fifthharmonicUab,
	fifthharmonicUbc,
	fifthharmonicUca,
	fifthharmonicU0,
	fifthharmonicIa,
	fifthharmonicIb,
	fifthharmonicIc,
	fifthharmonicI0;
}TelemetryAddr;

