jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
#define TELEMETRY_TOTAL_NUM (sizeof(TelemetryAddr)/sizeof(rt_uint16_t))
 
enum TelecontrlAddr
{
    ADDR_REMOTE_OPERATE,          // 遥控操作
	ADDR_REMOTE_ACTIVE,           // 电池活化
	ADDR_REMOTE_RESET,            // 远方复位
	ADDR_REMOTE_CLEAR,            // 远方清除记录
    ADDR_REMOTE_RECLOSE_OUT,      // 重合闸退出
    ADDR_REMOTE_CONTACT_OUT,      // 联络退出
    ADDR_LOCAL_OPERATE,           // 本地操作
	ADDR_LOCAL_RESET,             // 本地复位
	ADDR_LOCAL_CLEAR,             // 本地清除记录
	ADDR_HANDHELD_OPER,           // 手持操作
 
    REMOTE_TOTAL_NUM,    
    
	ADDR_LOGIC_ACT,               // 逻辑动作	
};

/* PARA ----------------------------------------------------------------------*/
#define RT_SYS_CONFIG_DEFAULT                           \
{                                                       \
    "F31                     ",                         \
    "RT-Thread               ",                         \
    "                        ",                         \
    "HV01.01                 ",                         \
    "SV03.021                ",                         \
    "CRC                     ",                         \
    "101 / 104               ",                         \
    "SJFD2000                ",                         \
    "F31xxxxxxxxx20171211xxxx",                         \
    "                        ",	                        \
    TERMINAL_PRODUCT_SERIAL_NUMBER                      \
}

#define SIZEOFINTRIPARAME             24          // 固有参数长度

#define SN_MIN                        0           // 最小定值区号
#define SN_MAX                        2           // 最大定值区号
#define DB_SN0                        0           // 0区
#define DB_SN1                        1           // 1区
#define DB_SN2                        2           // 2区
#define DB_CALI                       3           // 校准系数区

enum ParameterType
{
    ZERODRIFT,
    DEADZONE,
    CALIBRATE_FACTOR,
};

struct Inherent
{
    char terminalType[SIZEOFINTRIPARAME];                      // 终端类型
    char terminalOpreatSystem[SIZEOFINTRIPARAME];              // 终端操作系统
    char terminalManufacturer[SIZEOFINTRIPARAME];              // 终端制造商
    char terminalHardwareVersion[SIZEOFINTRIPARAME];           // 终端硬件版本
    char terminalSoftwareVersion[SIZEOFINTRIPARAME];           // 终端软件版本
    char terminalSoftwareVersionCheckCode[SIZEOFINTRIPARAME];  // 终端软件版本校验码
    char terminalCommunicationProtocolType[SIZEOFINTRIPARAME]; // 终端通信规约类型
    char terminalFactoryModel[SIZEOFINTRIPARAME];              // 终端出厂型号
    char terminalID[SIZEOFINTRIPARAME];                        // 终端ID号
    char terminalMAC[SIZEOFINTRIPARAME];                       // 终端网卡MAC地址
    char terminalProductSerialNumber[SIZEOFINTRIPARAME];                       // 终端产品序列号
};

		
typedef union TagInherentPara
{
    struct Inherent Str;
    char buf[sizeof(struct Inherent) / sizeof(char)];
} InherentPara;

enum AddrRunParameter
{
    CFG_POW_VOL_AB,                       // 功率电压AB
    CFG_POW_VOL_CB,                       // 功率电压CB
    CFG_PRO_VOL_N,                        // N侧保护电压
    OPERATING_MECHANISM,                  // 操作机构(0-弹簧/1-永磁)
    DISTRIBUTE_SWITCH,                    // 对等通讯模式
	BREAK_WORK_MODE,                      // 断路器工作模式(0-无/1-常规保护/2-电压时间型/3-电压电流型/4-电流计数型)
	LOAD_WORK_MODE,                       // 负荷开关工作模式(0-无/1-电压时间型/2-电压电流型/3-电流计数型/4-分界负荷开关型)
	CONNECT_SWITCH_RECOGNIZE,             // 联络开关识别
	OUTPUT_OVERTURN,                      // 永磁输出翻转
	CAP_UNDERVOLTAGE_CLOSING,	          // 合闸电容欠压定值
	CAP_UNDERVOLTAGE_OPENING,             // 分闸电容欠压定值
	CAP_UNDERVOLTAGE_FACTOR,			  // 电容欠压返回系数
	RATIO_U_ONE_TURN,                     // 电压变比一次	
	RATIO_U_SECONDARY,                    // 电压变比二次
	RATIO_U0_ONE_TURN,                    // 零序电压变比一次
	RATIO_U0_SECONDARY,                   // 零序电压变比二次	
	RATIO_I_ONE_TURN,                     // 电流变比一次	
	RATIO_I_SECONDARY,                    // 电流变比二次
	RATIO_I0_ONE_TURN,                    // 零序电流一次变比
	RATIO_I0_SECONDARY,                   // 零序电流二次变比	
    DI_SHAKING_TIME,                      // 开入采集防抖时间 
    CLOSING_PULSE_TIME,                   // 合闸脉宽时间
    OPENING_PULSE_TIME,			          // 分闸脉宽时间
    REVERSE_TIME,                         // 反校时间
    POWERLOSS_NEGATE,                     // 电源告警取反
    ZERODRIFT_F,                          // 频率零漂
    ZERODRIFT_Ia,                         // A相电流零漂 
    ZERODRIFT_Ib,                         // B相电流零漂
    ZERODRIFT_Ic,                         // C相电流零漂
    ZERODRIFT_I0,                         // 零序电流零漂
    ZERODRIFT_Uab,                        // 线电压Uab零漂
    ZERODRIFT_Ucb,                        // 线电压Ucb零漂
    ZERODRIFT_Uac,                        // 线电压Uac零漂
    ZERODRIFT_U0,                         // 零序电压零漂
    ZERODRIFT_UAB,                        // 线电压UAB零漂
    ZERODRIFT_UCB,                        // 线电压UCB零漂
    ZERODRIFT_P,                          // 有功功率零漂
    ZERODRIFT_Q,                          // 无功功率零漂
    ZERODRIFT_S,                          // 视在功率零漂
    ZERODRIFT_PF,                         // 功率因数零漂	
    ZERODRIFT_DC1,                        // 直流电压零漂	
    ZERODRIFT_DC2,                        // 直流电压2零漂
    ZERODRIFT_T,                          // 温度零漂	
    DEADZONE_F,                           // 频率死区
    DEADZONE_Ia,                          // A相电流死区
    DEADZONE_Ib,                          // B相电流死区
    DEADZONE_Ic,                          // C相电流死区
    DEADZONE_I0,                          // 零序电流死区
    DEADZONE_Uab,                         // 线电压Uab死区
    DEADZONE_Ucb,                         // 线电压Ucb死区
    DEADZONE_Uac,                         // 线电压Uac死区
    DEADZONE_U0,                          // 零序电压死区
    DEADZONE_UAB,                         // 线电压UAB死区
    DEADZONE_UCB,                         // 线电压UCB死区
    DEADZONE_P,                           // 有功功率死区
    DEADZONE_Q,                           // 无功功率死区
    DEADZONE_S,                           // 视在功率死区
    DEADZONE_PF,                          // 功率因数死区
    DEADZONE_DC1,                         // 直流电压死区
    DEADZONE_DC2,                         // 直流量2死区
    DEADZONE_T,				              // 温度死区	
    UART_PORT,                            // 串口号
    UART_BAUDRATE,                        // 波特率
    UART_WORDLENGTH,                      // 数据位
    UART_STOPBITS,                        // 停止位
    UART_PARITY,                          // 校验位
    UART_BALANMODE,                       // 串口模式
    UART_SOURCEADDR,                      // 从站地址
    UART_LINKADDRSIZE,                    // 从站地址长度
    UART_ASDUCOTSIZE,                     // 传送原因字节数
    UART_ASDUADDR,                        // ASDU地址
    UART_ASDUADDRSIZE,                    // ASDU地址长度
    NET_IP1_0,                            // IP上
    NET_IP1_1,                            // IP上
    NET_IP1_2,                            // IP上
    NET_IP1_3,                            // IP上
    NET_IP2_0,                            // IP下
    NET_IP2_1,                            // IP下
    NET_IP2_2,                            // IP下
    NET_IP2_3,                            // IP下
    NET_GATEWAY_0,                        // 网关
    NET_GATEWAY_1,                        // 网关
    NET_GATEWAY_2,                        // 网关
    NET_GATEWAY_3,                        // 网关   
    NET_SOURCEADDR,                       // 从站地址
    NET_ASDUADDR,                         // ASDU地址  
    REMOTE_PRO_SWITCH,                    // 遥控保护压板投退
	
    RUN_PARAMETER_NUM,	                  // 运行参数数量
};

enum AddrCalibrateFactor
{
    CALIFACTOR_F,                        // 频率校准系数
	CALIFACTOR_Ia,                       // A相电流(Ia)校准系数
	CALIFACTOR_Ib,                       // B相电流(Ib)校准系数
    CALIFACTOR_Ic,                       // C相电流(Ic)校准系数
	CALIFACTOR_I0,                       // 零序电流(I0)校准系数
    CALIFACTOR_Uab,                      // 线电压(Uab)校准系数
	CALIFACTOR_Ucb,                      // 线电压(Ucb)校准系数
    CALIFACTOR_Uac,                      // 线电压(Uac)校准系数
	CALIFACTOR_U0,                       // 零序电压(U0)校准系数
    CALIFACTOR_UAB,                      // 线电压(UAB)校准系数
	CALIFACTOR_UCB,                      // 线电压(UCB)校准系数
    CALIFACTOR_P,                        // 有功功率(p)校准系数（无效）
	CALIFACTOR_Q,                        // 无功功率(Q)校准系数（无效）
    CALIFACTOR_S,                        // 视在功率(S)校准系数（无效）
	CALIFACTOR_PF,                       // 功率因数(Pf)校准系数（无效） 		
    CALIFACTOR_DC1,                      // 直流电压(V)校准系数
	CALIFACTOR_DC2,                      // 直流电压(V)校准系数
    CALIFACTOR_T,			             // 温度(T)校准系数
	CALIFACTOR_ALPHA_UabIa,	             // 角UaIa校准系数
	CALIFACTOR_ALPHA_UcbIc,	             // 角UcIc校准系数
	CALIFACTOR_ALPHA_U0I0,	             // 角U0I0校准系数
	CALIFACTOR_ALPHA_UxUx,	             // 角UxUx校准系数		
    CALIFACTOR_F2,                       // 频率校准系数
	
	CALIFACTOR_NUM
};

enum AddrFixedValue
{
    OVER_CURRENT_SWITCH1,                // 过流1段投退 “1投入”、“0退出”
//    DIRE_CTIONLOCK_SWITCH1,              // 过流1段方向闭锁 “1投入”、“0退出”
	OVER_CURRENT_VALUE1,                 // 过流1段电流 流定值，整定范围：00.00A~99.99A
	OVER_CURRENT_TIME1,                  // 过流1段时间 时间定值，整定范围：00.00s~99.99s
    OVER_CURRENT_SWITCH2,                // 过流2段投退 “1投入”、“0退出”
//    DIRE_CTIONLOCK_SWITCH2,              // 过流2段方向闭锁 “1投入”、“0退出”
	OVER_CURRENT_VALUE2,                 // 过流2段电流 电流定值，整定范围：00.00A~99.99A
	OVER_CURRENT_TIME2,                  // 过流2段时间 时间定值，整定范围：00.00s~99.99s    
	OVER_CURRENT_SWITCH3,                // 过流3段投退 “1投入”、“0退出”
//    DIRE_CTIONLOCK_SWITCH3,              // 过流3段方向闭锁 “1投入”、“0退出”
	OVER_CURRENT_VALUE3,                 // 过流3段电流 电流定值，整定范围：00.00A~99.99A
	OVER_CURRENT_TIME3,                  // 过流3段时间 时间定值，整定范围：00.00s~99.99s	
    OVER_CURRENTI0_SWITCH1,              // 零序过流1段投退 “1投入”、“0退出”
	OVER_CURRENTI0_VALUE1,               // 零序过流1段电流 流定值，整定范围：00.00A~99.99A
	OVER_CURRENTI0_TIME1,                // 零序过流1段时间 时间定值，整定范围：00.00s~99.99s	
    OVER_CURRENTI0_SWITCH2,              // 零序过流2段投退 “1投入”、“0退出”
	OVER_CURRENTI0_VALUE2,               // 零序过流2段时间 时间定值，整定范围：00.00s~99.99s
	OVER_CURRENTI0_TIME2,                // 零序过流2段时间 时间定值，整定范围：00.00s~99.99s		
	OVERLIMIT_SWITCH,                    // 越限报警功能投退
	UPLIMIT_FACTOR,                      // 越限上限系数
	DOWNLIMIT_FACTOR,                    // 越限下限系数
    OVERLIMIT_TIME,                      // 越限延时
	OVERLIMIT_ALARM_SWITCH_Uab,          // Uab越限报警投退 
	OVERLIMIT_ALARM_SWITCH_Ubc,          // Ubc越限报警投退
	OVERLIMIT_ALARM_SWITCH_Uca,          // Uca越限报警投退	
	OVERLIMIT_ALARM_SWITCH_UAB,          // UAB越限报警投退 	
	OVERLIMIT_ALARM_SWITCH_UBC,          // UBC越限报警投退
	UPLIMIT_VOLTAGE_U,                   // 电压上限定值
	DOWNLIMIT_VOLTAGE_U,                 // 电压下限定值
	OVERLIMIT_ALARM_SWITCH_IA,           // Ia越限报警投退
	OVERLIMIT_ALARM_SWITCH_IB,           // Ib越限报警投退
	OVERLIMIT_ALARM_SWITCH_IC,           // Ic越限报警投退
	UPLIMIT_CURRENT_I,                   // 电流上限定值
	DOWNLIMIT_CURRENT_I,                 // 电流下限定值	
	OVERLIMIT_ALARM_SWITCH_U0,           // 零序电压越限投退	
	UPLIMIT_VOLTAGE_U0,                  // 零序电压上限定值
	DOWNLIMIT_VOLTAGE_U0,                // 零序电压下限定值
	OVERLIMIT_ALARM_SWITCH_I0,           // 零序电流越限投退	
	UPLIMIT_VOLTAGE_I0,                  // 零序电流上限定值
	DOWNLIMIT_VOLTAGE_I0,                // 零序电流下限定值	
	OVERLIMIT_ALARMSWITCH_DC_U,          // 直流电压越限投退
	UPLIMIT_DC_VOLTAGE_U,                // 直流电压上限定值
	DOWNLIMIT_DC_VOLTAGE_U,              // 直流电压下限定值
	OVERLIMIT_ALARMSWITCH_DC_I,          // 直流电流越限投退
	UPLIMIT_DC_CURRENT_I,                // 直流电流上限定值
	DOWNLIMIT_DC_CURRENT_I,              // 直流电流下限定值	
	HEAVY_OVERLOAD_SWITCH,               // 重过载保护投退
	HEAVY_OVERLOAD_VALUE,                // 重过载定值
	HEAVY_OVERLOAD_FACTOR,               // 重过载返回系数		
	HEAVY_OVERLOAD_TIME,                 // 重过载延时	
	OVERLOAD_SWITCH,                     // 过负荷保护投退
	OVERLOAD_VALUE,                      // 过负荷定值
	OVERLOAD_FACTOR,                     // 过负荷返回系数		
	OVERLOAD_TIME,	                     // 过负荷延时
//  BATTERY_LOWVOLTAGE_ALARM_SWITCH,     // 蓄电池低压报警投退	
//	BATTERY_LOWVOLTAGE_VALUE,            // 电池低压定值
//	BATTERY_LOWVOLTAGE_FACTOR,           // 电池低压返回系数		
//	BATTERY_LOWVOLTAGE_TIME,             // 电池低压延时	
    BATTERY_ACTIVE_SWITCH,               // 电池活化投退
    BATTERY_ACTIVE_CYCLE,                // 电池活化周期(天)
    BATTERY_ACTIVE_TIME,                 // 电池活化时间(h)
    BATTERY_ACTIVE_FAULT_VOLTAGE,        // 电池活化故障电压
    BATTERY_ACTIVE_FAULT_TIME,           // 电池活化故障延时
	AUTOMATIC_RESET_SWITCH,              // 自动复归使能
	AUTOMATIC_RESET_TIME,                // 自动复位时间
	OVERVOLTAGE_SWITCH,                  // 过压投退
	OVERVOLTAGE_VALUE,                   // 过压定值
    OVERVOLTAGE_TIME,                    // 过压时间
    OVERVOLTAGE_FACTOR,                  // 过压返回系数	
	OVERFREQUENCY_SWITCH,                // 过频投退
	OVERFREQUENCY_VALUE,                 // 过频定值
    OVERFREQUENCY_TIME,                  // 过频时间
    OVERFREQUENCY_FACTOR,                // 过频返回系数	
	DOWNVOLTAGE_SWITCH,                  // 低压投退
	DOWNVOLTAGE_VALUE,                   // 低压定值
    DOWNVOLTAGE_TIME,                    // 低压时间
    DOWNVOLTAGE_FACTOR,                  // 低压返回系数	
	DOWNFREQUENCY_SWITCH,                // 低频投退
	DOWNFREQUENCY_VALUE,                 // 低频定值
    DOWNFREQUENCY_TIME,                  // 低频时间
    DOWNFREQUENCY_FACTOR,                // 低频返回系数	
    CLOSING_LOOP_SWITCH,                 // 合环功能投退
    VOLTAGE_DIFFERENCE,                  // 两侧压差	
	PHASEANGLE_DIFFERENCE,				 // 相角差
    FREQUENCY_DIFFERENCE,				 // 频率差
    CONTROL_LOOP_ABNOMAL_ENABLE,         // 控制回路异常使能	
	INVERSE_SWITCH,                      // 反时限投退
	INVERSE_CURRENT_VALUE,               // 反时限保护电流值
	INVERSE_TIME,                        // 反时限保护延时
	IACC_SWITCH,                         // 后加速投退 软压板定值，可以选择“投入”、“退出"
	IACC_CURRENT_VALUE,                  // 后加速电流 电流定值，整定范围：00.00s~99.99A
	IACC_TIME,                           // 后加速时间 时间定值，整定范围：00.00s~99.99s	
	INRUSH_SWITCH,                       // 涌流抑制投退 软压板定值，可以选择“投入”、“退出”
	INRUSH_TIME,                         // 涌流抑制时间 时间定值，整定范围：0000~9999ms
	SECONDARY_RECLOSE_LOCK_SWITCH,       // 二次重合闸闭锁投退
	SECONDARY_RECLOSE_LOCK_TIME,         // 闭锁二次重合闸时间 时间定值，整定范围：00.00s~99.99
	RECLOSE_TIMES_I,                     // 重合闸次数 可以选择：0，1，2，3，4
	RECLOSE_TIMES_I0,                    // 零序重合闸次数 可以选择：0，1，2
	RECLOSE_TIMER1,                      // 1次重合闸时间 时间定值，整定范围：00.00s~99.99s
	RECLOSE_TIMER2,                      // 2次重合闸时间 时间定值，整定范围：00.00s~99.99s
	RECLOSE_TIMER3,                      // 3次重合闸时间 时间定值，整定范围：00.00s~99.99s
	RECLOSE_TIMER4,                      // 4次重合闸时间 时间定值，整定范围：00.00s~99.99s	
	RE_RESET_TIME,						 // 重合闸复位时间
	RE_CHARGE_TIME,						 // 重合闸充电时间
	CURRENT_VALUE,                       // 电流定值
	VOLTAGE_VALUE,                       // 电压定值
    NONVOLTAGE_VALUE,                    // 无电压定值
	FAULT_CHECK_Y_TIME,                  // 故障检测Y时间
	SHORT_LOCKED_OPENING_TIME,           // 短时闭锁分闸时间
	LOSS_ELECTRICITY_SWITCH,             // 失电分闸投退 “1投入”、“0退出”
	LOSS_OPENING_TIME,                   // 分闸时间
	GET_VOLTAGE_CLOSSING_SWITCH,         // 得电合闸投退
	GET_VOLTAGE_CLOSSING_X_TIME,         // 得电延时合闸X时间
	SINGLE_LOSS_VOLTAGE_SWITCH,          // 单侧失压延时合闸
	SINGLE_LOSS_VOLTAGE_XLTIME,            // 单侧失压延时XL时间
	DOUBLE_VOLTAGE_SWITCH,               // 双侧有压禁止合闸投退
	REMAIN_VOLTAGE_SWITCH,               // 残压脉冲投退
	REMAIN_VOLTAGE_VALUE,                // 残压定值
	VOLTAGE_U0_SWITCH,                   // 零序电压保护投退
	VOLTAGE_U0_VALUE,                    // 零序电压值
	VOLTAGE_U0_TIME,                     // 零序电压延时
	BREAKING_CURRENT_SWITCH,             // 非遮断电流投退
	BREAKING_CURRENT_VALUE,        		 // 非遮断电流
	DISTRIBUTE_ACTION_TYPE,              // 动作类型（速动型、缓动型）
	DISTRIBUTE_OVER_CURRENT_VAL,         // 分布式相间过流定值
    DISTRIBUTE_OVERI0_CURRENT_VAL,       // 分布式零序过流定值
	DISTRIBUTE_HAVE_CURRENT_VAL,         // 分布式有流定值    
	DISTRIBUTE_OVER_VOLTAGE_VAL,         // 分布式有压定值
    DISTRIBUTE_OVER_NO_VOLTAGE_VAL,      // 分布式无压定值	
	DISTRIBUTE_POWER_CHANGE_LOAD,        // 分布式转供电负荷
	
	FIXED_VALUE_NUM                      // 定值数量
};

/* common操作结构体 */
struct CommonInfo
{
    uint8_t operateType; // 操作类型 SOE/定值
    uint32_t num;        // 定值数量
    uint8_t sn;          // 定值区号
};

/* 定值/参数操作结构体 */
struct ValueParameterOperate
{
    uint8_t type;        // 操作类型 预置/固化/撤回
    uint32_t num;        // 定值数量
    uint32_t len;        // 预置字节数
    uint8_t operateSN;   // 操作定值区号
    uint8_t currentSN;   // 当前运行定值区号
    uint8_t calibratFlag;// 校准标志
};


typedef struct TagValueParameterStr
{
    uint16_t addr;
    uint8_t tag;
    uint8_t length;
} ValueParameterStr;

