jiangchiwu100/SmartTerminalUnit/FTU/bsp/stm32f429-apollo/applications/common_data/common_data.h
/* 新遥控点表映射 */
extern rt_uint16_t g_NewToOldRemote[REMOTE_TOTAL_NUM];//新点表映射，填原点表数组下标
extern rt_uint16_t g_NewToOldPropertyRemote[REMOTE_TOTAL_NUM];//新点表属性

/* 通讯互锁标志 */
extern rt_uint32_t g_CommunicatFlag[COM_MAX];

/* 定值和参数缓存 */

//extern FixedValue *g_pFixedValue;
extern struct Inherent  g_InherentPara;
extern float    *g_pFixedValue;
extern float     g_FixedValue1[FIXED_VALUE_NUM];
extern float     g_FixedValue2[FIXED_VALUE_NUM];

extern float     g_Parameter[RUN_PARAMETER_NUM];
extern float     g_CalibrateFactor[CALIFACTOR_NUM];
extern struct    tagValueParaCfg  *g_pFixedValueCfg;

/* 定值操作信息 */
extern struct ValueParameterOperate g_ValueParaOperateInfo;

/* 定值和参数预置缓存 */
extern struct ValueParaPreset g_ValueParaPresetDB;

/* 需存储记忆数据 */
extern struct MEMORY_FLAG_Str g_FlagDB;

/* COS缓存 */
extern struct COS_Str g_COSDB[COS_MAX_NUM];

/* SOE缓存 */
extern struct SOE_Str g_SOEDB[SOE_MAX_NUM];
extern struct SOE_Str g_SOENewDB[SOE_NEW_MAX_NUM];
/* CO缓存 */
extern struct CO_Str g_CoDB[CO_MAX_NUM];

/* FEVENT缓存 */
extern struct FEVENT_Str g_FeventDB[FEVENT_MAX_NUM];

/* ULOG缓存 */
extern struct ULOG_Str g_UlogDB[ULOG_MAX_NUM];

/* NVA缓存 */
extern struct NVA_Str g_NVADB[NVA_MAX_NUM];

/* COS缓存参数 */
extern rt_uint32_t g_COSDBIn;
extern rt_uint32_t g_COSDBOut[DEV_MAX_NUM];

/* NVA缓存参数 */
extern rt_uint32_t g_NVADBIn;
extern rt_uint32_t g_NVADBOut[DEV_MAX_NUM];

/* 通讯信息 */
extern struct lwip_dev g_EthW5500; // w5500 information
extern struct lwip_dev g_EthDP83848; // dp83848 

/* 通讯灯状态 */
extern rt_uint32_t g_ComLed;

/* PUBLIC FUNCTION  ----------------------------------------------------------*/
extern uint8_t rt_multi_common_read_update_state(void);
extern void rt_multi_common_write_update_state(const uint8_t sta);

extern void rt_multi_common_data_save_value_to_fram(uint8_t sn);
extern void rt_multi_common_data_get_value_from_fram(uint8_t sn);
extern void rt_common_data_save_value_default_to_fram(void);
extern rt_uint16_t rt_multi_common_data_fram_record_write(uint8_t type, uint8_t *pBuf, uint32_t len);
extern void rt_multi_common_data_fram_update_state_write(uint8_t type);
extern void rt_multi_common_data_fram_record_read(uint8_t type, uint8_t *pBuf);
extern void rt_multi_common_data_powerdown_storage(void);


extern int rt_multi_common_data_init(void);
extern uint8_t rt_multi_telecontrl_proof(uint16_t addr, rt_uint8_t operate_type);
extern rt_uint8_t rt_multi_telecontrl_operate(uint16_t addr, rt_uint8_t operate_type);
extern float* GetValueArray(uint16_t addr, uint8_t sn);
extern void ParameterCheck(void);

extern uint8_t DBReadValueAreaSN(void);
extern uint8_t DBSwitchValueArea(uint8_t sn);

extern uint8_t DBWriteValue(uint8_t *pData, struct CommonInfo *pInfo);
extern uint8_t DBReadValue(uint16_t *pAddr, uint32_t num, uint8_t *pData, uint8_t sn, uint32_t *length);

extern void DBReadSystemTime(struct CP56Time2a_t *pTime);
extern void DBWriteSystemTime(struct CP56Time2a_t *pTime);

extern rt_uint8_t DBWriteSOE(uint16_t addr, rt_uint8_t state);
extern rt_uint8_t DBWriteCO(uint16_t addr, rt_uint8_t state);
extern rt_uint8_t DBWriteFEVENT(rt_uint16_t yx_addr, rt_uint16_t *yc_addr, rt_uint16_t yc_num);


extern uint8_t DB_NVA_Check(void);
extern void DBClearNVA(void);
extern float SelectRatio(rt_uint8_t ratioType, float ratioValue);  
extern void CalibrationFactorCal(uint8_t num);

extern int FloatToBin(float fl);
extern float BinToFloat(int bin);
extern uint8_t DecimalToBCD(uint8_t dec);
extern uint8_t BCDToDecimal(uint8_t bcd);
#endif 

/* END OF FILE ---------------------------------------------------------------*/
